<?php

return [
    'auth' => [
        'failed' => 'Неверный email или пароль. Пожалуйста, проверьте введенные данные и попробуйте снова.'
    ],
    'cars' => [
        'added' => 'Данные об автомобиле успешно добавлены.',
        'updated' => 'Данные об автомобиле успешно обновлены.',
        'restored' => 'Данные об автомобиле успешно восстановлены.',
        'vin-exists' => 'VIN автомобиля «:vin» уже присутствует в каталоге. Восстановление невозможно.',
        'deleted' => 'Данные об автомобиле перенесены в корзину.',
        'permanently-deleted' => 'Данные об автомобиле окончательно удалены.'
    ],
    'tags' => [
        'added' => 'Тег успешно добавлен.',
        'updated' => 'Название тега успешно обновлено.',
        'deleted' => 'Тег успешно удален.'
    ],
    'brands' => [
        'added' => 'Информация о марке автомобиля успешно добавлена.',
        'updated' => 'Информация о марке автомобиля успешно обновлена.',
        'deleted' => 'Марка автомобиля успешно удалена.',
        'cannotBeDeleted' => 'Марку нельзя удалить, т.к. за ней закреплены автомобили.'
    ],
    'countries' => [
        'added' => 'Название страны успешно добавлена.',
        'updated' => 'Название страны успешно обновлено.',
        'deleted' => 'Название страны успешно удалено.',
        'cannotBeDeleted' => 'Страну нельзя удалить, т.к. за ней закреплены марки автомобилей.'
    ],
    'comments' => [
        'added' => 'Комментарий успешно добавлен.',
        'updated' => 'Комментарий успешно обновлен.',
        'deleted' => 'Комментарий успешно удален.'
    ]
];
